# AnalyticalPanel Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalPanel Class
Members See Also
---
An element that represents a surface in the Structural Analytical Model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class AnalyticalPanel : AnalyticalSurfaceBase
```

Visual Basic
---
```text
Public Class AnalyticalPanel _
	Inherits AnalyticalSurfaceBase
```

Visual C++
---
```text
public ref class AnalyticalPanel : public AnalyticalSurfaceBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..AnalyticalElement Autodesk.Revit.DB.Structure..::..AnalyticalSurfaceBase Autodesk.Revit.DB.Structure..::..AnalyticalPanel
# See Also
AnalyticalPanel Members
Autodesk.Revit.DB.Structure Namespace